; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v6 - type_3 ?v5 - type_1)
 	      (pred_3 ?v1 - object ?v5 - type_1)
	      (pred_4 ?v6 - type_3 ?v3 - type_2)
	      (pred_2 ?v6 - type_3 ?v1 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v6 - type_3 ?v4 ?v7 - type_1)
       :precondition (and  (pred_1 ?v6 ?v4))
       :effect (and  (pred_1 ?v6 ?v7)
		     (not (pred_1 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_3 ?v8 - object ?v2 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v2) (pred_1 ?v6 ?v2) (pred_4 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v8 ?v3)
		    (not (pred_3 ?v8 ?v2)) 
		    (not (pred_4 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_3 ?v8 - object ?v2 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v8 ?v3) (pred_1 ?v6 ?v2))
       :effect (and (pred_3 ?v8 ?v2)
		    (pred_4 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v8 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_02 obj_08 - type_2
obj_01 obj_06 obj_04 - type_1
obj_09 obj_03 obj_05 - object)
(:init
(pred_1 obj_07 obj_01)
(pred_4 obj_07 obj_02)
(pred_4 obj_07 obj_08)
(pred_3 obj_09 obj_01)
(pred_3 obj_03 obj_01)
(pred_3 obj_05 obj_01)
)
(:goal
(and
(pred_3 obj_09 obj_04)
(pred_3 obj_03 obj_06)
(pred_3 obj_05 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_07 ?b obj_08))))
)
)

; plan
1. (op_2 obj_07 obj_09 obj_01 obj_02)
   deleted: (pred_3 obj_09 obj_01) (pred_4 obj_07 obj_02)
   added: (pred_2 obj_07 obj_09 obj_02)
   goals met: 0 of 3
2. (op_3 obj_07 obj_01 obj_04)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_04)
   goals met: 0 of 3
3. (op_1 obj_07 obj_09 obj_04 obj_02)
   deleted: (pred_2 obj_07 obj_09 obj_02)
   added: (pred_3 obj_09 obj_04) (pred_4 obj_07 obj_02)
   goals met: 1 of 3
4. (op_3 obj_07 obj_04 obj_01)
   deleted: (pred_1 obj_07 obj_04)
   added: (pred_1 obj_07 obj_01)
   goals met: 1 of 3
5. (op_2 obj_07 obj_03 obj_01 obj_02)
   deleted: (pred_3 obj_03 obj_01) (pred_4 obj_07 obj_02)
   added: (pred_2 obj_07 obj_03 obj_02)
   goals met: 1 of 3
6. (op_3 obj_07 obj_01 obj_06)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_06)
   goals met: 1 of 3
7. (op_1 obj_07 obj_03 obj_06 obj_02)
   deleted: (pred_2 obj_07 obj_03 obj_02)
   added: (pred_3 obj_03 obj_06) (pred_4 obj_07 obj_02)
   goals met: 2 of 3
8. (op_3 obj_07 obj_06 obj_01)
   deleted: (pred_1 obj_07 obj_06)
   added: (pred_1 obj_07 obj_01)
   goals met: 2 of 3
9. (op_2 obj_07 obj_05 obj_01 obj_02)
   deleted: (pred_3 obj_05 obj_01) (pred_4 obj_07 obj_02)
   added: (pred_2 obj_07 obj_05 obj_02)
   goals met: 2 of 3
10. (op_3 obj_07 obj_01 obj_04)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_04)
   goals met: 2 of 3
11. (op_1 obj_07 obj_05 obj_04 obj_02)
   deleted: (pred_2 obj_07 obj_05 obj_02)
   added: (pred_3 obj_05 obj_04) (pred_4 obj_07 obj_02)
   goals met: 3 of 3
